#ifndef MPV_H
#define MPV_H

#include "mdr32fx.h"
#include "types.h"
#include "MPV_messages.h"

/*******************************************************************
                            Объявления 
*******************************************************************/
extern BOOL systick_it_flag;

/*******************************************************************
                            Прототипы
*******************************************************************/
void MPV_Init(void);
void MPV_Config(void);

#endif
