#include "ports.h"

/*******************************************************************
                        Нога для отладки
*******************************************************************/
void PortD_Test(void){
    PORT_InitTypeDef GPIO_ini;
   
    GPIO_ini.PORT_Pin       = PORT_Pin_2;
    GPIO_ini.PORT_OE        = PORT_OE_OUT;
    GPIO_ini.PORT_PULL_UP   = PORT_PULL_UP_OFF;
    GPIO_ini.PORT_PULL_DOWN = PORT_PULL_DOWN_OFF;
    GPIO_ini.PORT_PD_SHM    = PORT_PD_SHM_OFF;
    GPIO_ini.PORT_PD        = PORT_PD_DRIVER;
    GPIO_ini.PORT_GFEN      = PORT_GFEN_OFF; 
    GPIO_ini.PORT_FUNC      = PORT_FUNC_PORT;
    GPIO_ini.PORT_SPEED     = PORT_SPEED_MAXFAST;
    GPIO_ini.PORT_MODE      = PORT_MODE_DIGITAL;
    
    PORT_Init(MDR_PORTD, &GPIO_ini);
}


/*******************************************************************
      Инициализация порта А (PA0..PA7 - Data, PA8..PA15 - Adr)      
*******************************************************************/
void PortA_Init(void){
    MDR_RST_CLK -> PER_CLOCK |= (1 << 21);     // Тактирование порта A
    
    MDR_PORTA->OE        = 0x0000FFFF;         // Выход (15:0)
    MDR_PORTA->ANALOG    = 0x0000FFFF;         // Цифровой (15:0)
    MDR_PORTA->FUNC      = 0x00000000;         // Порт
    MDR_PORTA->PWR       = 0xFFFFFFFF;         // Максимально быстрый (31:0)
    MDR_PORTA->RXTX      = 0x00000000;     
}

/*******************************************************************
           Инициализация порта С (PC0 - write, PC1 - read)
*******************************************************************/
void PortC_Init(void){
    MDR_RST_CLK->PER_CLOCK |= (1 << 23);      // Тактирование порта C
    
    MDR_PORTC->OE     |=  ((1 << 0) | 
                           (1 << 1));         // Выход
    MDR_PORTC->ANALOG |=  ((1 << 0) | 
                           (1 << 1));         // Цифровой
    
    MDR_PORTC->FUNC   &= ~((3 << 0*2) |
                           (3 << 1*2));       // Порт
    
    MDR_PORTC->PWR    |=  ((3 << 0*2) |
                           (3 << 1*2));       // Максимально быстрый
    
    MDR_PORTC->RXTX    =  ((0 << 0) |
                           (0 << 1));     
}       

/*******************************************************************
           Инициализация порта С (PC0 - write, PC1 - read)В
*******************************************************************/
void PortD_Init(void){
    MDR_RST_CLK->PER_CLOCK |= (1 << 24);        // Тактирование порта D
    
    MDR_PORTD->OE     |=  ((1 << 10) | 
                           (1 << 11) |
                           (1 << 12) |
                           (1 << 13) |
                           (1 << 14));         // Выход    
    
    MDR_PORTD->ANALOG |=  ((1 << 10) | 
                           (1 << 11) |
                           (1 << 12) |
                           (1 << 13) |
                           (1 << 14));         // Цифровой
    
    MDR_PORTD->FUNC   &= ~((3 << 10*2) | 
                           (3 << 11*2) |
                           (3 << 12*2) |
                           (3 << 13*2) |
                           (3 << 14*2));       // Порт
    
    MDR_PORTD->PWR    |=  ((3 << 10*2) | 
                           (3 << 11*2) |
                           (3 << 12*2) |
                           (3 << 13*2) |
                           (3 << 14*2));       // Максимально быстрый
    
    MDR_PORTD->RXTX    =  ((0 << 10) | 
                           (0 << 11) |
                           (0 << 12) |
                           (0 << 13) |
                           (0 << 14));    
}

/*******************************************************************
                    Инициализация ext int 1     
*******************************************************************/
void Ext_Int1_Init(void){
    MDR_RST_CLK->PER_CLOCK |=  (1 << 22);       // Тактирование порта В
    
    MDR_PORTB->OE          |= ((0 << 11));      // Вход 
    MDR_PORTB->ANALOG      |= ((1 << 11));      // Цифровой
    MDR_PORTB->FUNC        |= ((2 << 11*2));    // Альт. функция  
    MDR_PORTB->PWR         |= ((3 << 11*2));    // Максимально быстрый   
	
	NVIC_EnableIRQ(EXT_INT1_IRQn);
    NVIC_ClearPendingIRQ(EXT_INT1_IRQn);
}

/*******************************************************************
                    Инициализация ext int 2     
*******************************************************************/
void Ext_Int2_Init(void){
    MDR_RST_CLK->PER_CLOCK |=  (1 << 22);       // Тактирование порта В
    
    MDR_PORTB->OE          |= ((0 << 10));      // Вход   
    MDR_PORTB->ANALOG      |= ((1 << 10));      // Цифровой     
    MDR_PORTB->FUNC        |= ((2 << 10*2));    // Альт. функция          
    MDR_PORTB->PWR         |= ((3 << 10*2));    // Максимально быстрый            
	
    NVIC_EnableIRQ(EXT_INT2_IRQn);            
}

/*******************************************************************
                    Инициализация ext int 3     
*******************************************************************/
void Ext_Int3_Init(void){
    MDR_RST_CLK->PER_CLOCK |= (1 << 25);        // Тактирование порта E
    
    MDR_PORTE->OE          |= ((0 << 15));      // Вход   
    MDR_PORTE->ANALOG      |= ((1 << 15));      // Цифровой     
    MDR_PORTE->FUNC        |= 0x80000000;       // Альт. функция          
    MDR_PORTE->PWR         |= 0xC0000000;;      // Максимально быстрый
	
	NVIC_EnableIRQ(EXT_INT3_IRQn);            
}

/*******************************************************************
                    Инициализация ext int 4     
*******************************************************************/
void Ext_Int4_Init(void){
	MDR_RST_CLK->PER_CLOCK |= (1 << 23);        // Тактирование порта C

    MDR_PORTC->OE          |= ((0 << 13));      // Вход   
    MDR_PORTC->ANALOG      |= ((1 << 13));      // Цифровой     
    MDR_PORTC->FUNC        |= ((2 << 13*2));    // Альт. функция          
    MDR_PORTC->PWR         |= ((3 << 13*2));    // Максимально быстрый
	
	NVIC_EnableIRQ(EXT_INT4_IRQn);            
}

/*******************************************************************
                      Прерывание от EXT_INT1
*******************************************************************/
void EXT_INT1_IRQHandler(void){
    NVIC_DisableIRQ(EXT_INT1_IRQn);
    NVIC_EnableIRQ(TIMER1_IRQn); 
    MDR_TIMER1->CNTRL = (1 << 0);              // TIM1 start
}

/*******************************************************************
                      Прерывание от EXT_INT2
*******************************************************************/
void EXT_INT2_IRQHandler(void){

}

/*******************************************************************
                      Прерывание от EXT_INT3
*******************************************************************/
void EXT_INT3_IRQHandler(void){

}

/*******************************************************************
                      Прерывание от EXT_INT4
*******************************************************************/
void EXT_INT4_IRQHandler(void){

}
